app/views/users/index.html.erb

                <td><%= user.nickname %></td>
                <td><%= user.movies.count %></td>
---
SELECT COUNT(*) FROM "movies" INNER JOIN "users_movies" ON "movies"."id" = "users_movies"."movie_id" WHERE "users_movies"."user_id" = $1  [["user_id", 2]]