app/views/users/show.html.erb

            </p>
            <% @user.movies.each do |movie| %>
---
SELECT "movies".* FROM "movies" INNER JOIN "users_movies" ON "movies"."id" = "users_movies"."movie_id" WHERE "users_movies"."user_id" = $1  [["user_id", 2]]