app/controllers/comments_controller.rb

  def add
      Comment.create user_id: current_user.id, movie_id: params[:id_movie], message: params[:message]
---
INSERT INTO "comments" ("user_id", "movie_id", "message", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["movie_id", 3304], ["message", "lol"], ["created_at", 2017-01-05 16:42:29 UTC], ["updated_at", 2017-01-05 16:42:29 UTC]]