app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."torrent" = $1 ORDER BY "movies"."id" ASC LIMIT $2  [["torrent", "B81DF3E2AADDAC24AF86800C55D78F2D02DEC008"], ["LIMIT", 1]]
---
  def download
      try_get_movie = Movie.where(torrent: params[:hash]).first