app/controllers/users_controller.rb

UPDATE "users" SET "lname" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["lname", "tata"], ["updated_at", 2017-01-04 14:43:40 UTC], ["id", 2]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_user
        if params[:id] == "sign_out"
            reset_session
            redirect_to "/"
        else
            @user = User.find(params[:id])