app/controllers/users/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "floresnicolas86@gmail.com"], ["LIMIT", 1]]
---
  def create
     super
     session[:me] = User.where(:email => params[:user][:email]).first.email